[{
        "Name": "Vincent Namatjira",
        "Workshop": "Painting",
        "Degree": "Bachelor of Visual Arts (Painting)",
        "Thumbnail": "Vincent_Namatjira_1.jpg",
        "website":"https://thisisnofantasy.com/artist/vincent-namatjira/",
        "instagram":"https://www.instagram.com/Vincent_Namatjira",
        "Paragraph": "A painter from Indulkana in South Australia, Vincent Namatjira has established himself as a subversive and witty portraitist. Vincent is the great-grandson of the renowned Arrernte watercolour artist Albert Namatjira. Vincent was born in Alice Springs and spent his early childhood at Hermannsburg. When his mother passed away unexpectedly, Vincent was removed from his family and raised in foster homes. Intensely aware of his family’s history, he yearned to return to the central desert. He moved back to Hermannsburg as a young adult and then settled with his wife’s family at Kanpi, on the APY Lands, where he learnt to paint in a customary dot painting style. Since 2013, Vincent has been painting portraits of important figures, both personally familiar and famously political. He is an acute observer of national and international politics and the connections between leadership, wealth, power and influence."
    },
    {
        "Name": "Joyce Ho",
        "Workshop": "Photomedia",
        "Degree": " Master of Visual Arts",
        "Thumbnail": "Joyce_Ho_1.jpg",
        "website":"https://joycehostudio.com",
        "instagram":"https://www.instagram.com/Joyce_Ho",
        "Paragraph": "Joyce Ho’s works are unified by their striking aesthetic, which strips back unnecessary elements to foreground uncanny takes on gender roles, bureaucratic control and cultural conventions. This sets up strange spaces of encounter in which her audience has become increasingly central. Her paintings, installations, videos and performance works are notable for their saturated planes of colour — cool yellows and sickly greens — which typically surround neatly groomed young women. The women act as both avatars for the artist herself and enigmatic agents guiding audiences through nonsensical but compelling rituals. Ho’s interest in the tension between dream and reality, and between darkness and light, creates unusual atmospheres and strange situations that are at once uneasy, seductive and playfully humorous."
    },
    {
        "Name": "Rasheed Araeen",
        "Workshop": "Furniture",
        "Degree": "Bachelor of Visual Arts (Furniture)",
        "website": "https://www.grosvenorgallery.com/artists/50-rasheed-araeen/works/",
        "instagram": "https://www.instagram.com/Rasheed_Araeen",
        "Thumbnail": "Rasheed_Araeen_2.jpg",
        "Paragraph": "Rasheed Araeen began making conceptual and abstract art in his hometown of Karachi in the late 1950s before moving to London in 1964, where he devised some of Britain’s earliest minimalist sculptures. Now regarded as one of the pioneers of minimalist sculpture in the UK, Araeen is also an activist and a leading voice in challenging Eurocentric discourse around contemporary art. Though known for his sculpture, his artistic oeuvre has included abstract drawing and painting, collage, photography, multimedia and performance created over a career spanning six decades. In the early 1970s, Araeen aligned himself with radical black movements and produced photographic, text and collage works reflecting his political motivations. His Black Manifesto on the future of art in the third world was produced in 1975–76, and he established the contemporary art journal Third Text in 1987."
    },
    {
        "Name": "Geumhyung Jeong",
        "Workshop": "Sculpture",
        "Degree": "Bachelor of Visual Arts (Sculpture)",
        "Thumbnail": "Geumhyung_Jeong_1.jpg",
        "website:": "",
        "instagram": "https://www.instagram.com/Geumhyung_Jeong",
        "Paragraph": "Jeong Geumhyung is a dancer and choreographer whose practice began in the theatre and has recently extended to encompass installation. Her performances, which she describes as ‘duets’, feature the artist confronting monstrous ‘body-machines’. Jeong builds these by adapting various objects, from medical equipment and domestic technology, to take on human form. She sets up tense encounters suggestive of prosthesis, sexuality and agency, and the industries constructed around them. Recently she has begun to exhibit collections of her performance objects — which she refers to as her ‘collaborators’ — by arranging them on plinths under strip lighting like clinical specimens. Fitness equipment, party supplies, mannequins and medical apparatus are imbued with a bizarre anthropomorphic element and organised by unusual categories. Through her compelling performances and installations, Jeong explores the potential of human physicality, confronting anxieties and stereotypes regarding sexuality, the female body and artificial intelligence."
    }
]